{"pageProps":{"note":{"id":"61vh3qb7owg5f472h5dyeay","title":"Cyber Class Notes","desc":"","updated":1686947538995,"created":1686947501479,"custom":{},"fname":"cyber class notes","type":"note","vault":{"fsPath":".","selfContained":true,"name":"cyber"},"contentHash":"be266146f39484dd36d80a9051fa4254","links":[{"type":"wiki","from":{"fname":"cyber class notes","id":"61vh3qb7owg5f472h5dyeay","vaultName":"cyber"},"value":"Dashboard multiple desktop all windows","position":{"start":{"line":281,"column":1,"offset":22084},"end":{"line":281,"column":44,"offset":22127},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"Dashboard multiple desktop all windows"}}],"anchors":{"notes-in-plain-text":{"type":"header","text":"notes in plain text","value":"notes-in-plain-text","line":7,"column":0,"depth":2}},"children":[],"parent":"dlykua5hcrb6xvaq2hyi0yd","data":{}},"body":"<h1 id=\"cyber-class-notes\">Cyber Class Notes<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#cyber-class-notes\"></a></h1>\n<h2 id=\"notes-in-plain-text\">notes in plain text<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#notes-in-plain-text\"></a></h2>\n<p>Sep 23, 2022 networking_notes\nAn IP address is a 32 bit number that identifies a host on a network. But this  binary string is often converted to 4 decimal numbers separated by dots. A router only knows what the address of the next router is, not the exact destination of the packets. The first 24 bits specify where the host is, the last 8 specify the host itself. A subnet mask is a 32 bit string that splits the ip address host address from the network address.\nIP addresses are divided into classes, class A addresses have the first octet from 1 to 127 and has a subnet mask of 255.0.0.0, class B addresses from 128 to 191 and a subnet mask of 255.255.0.0, and class C addresses from 192 to 223\nA routing table is a table that holds the best routes for packets to go through.\nNov 1, 2022\nMemory Vocabulary:\nRAM - Random Access Memory\nDRAM - Dynamic RAM: in the ram stick\nSRAM - Static RAM: no need refresh, used for cache\nSDRAM - Synchronous DRAM: has greater concurrency of read and writes, faster\nThe memory bus is the bus which connects the main memory to the memory controller in computer systems.\nDDR SDRAM - Double data rate SDRAM: SDRAM works on the clock signal, Double data rate means it can read and write on the falling and rising edge of the clock cycle. So it's twice as fast\nDDR2 SDRAM - faster and needs less voltage\nDDR3 SDRAM - doubles the bandwidth, my doubling clock rate, generates less heat, up to 800 MHz\nDDR4 SDRAM - Quadruples the storage capacity, less power, has 288 pins, and doubles speed, first to support EEC\nGDDR - Graphics DDR, used in GPU\nNon Parity memory - doesn't have parity bit, redundant bit for error checking\nParity memory - has parity bit\nECC memory: Error Correction Code memory: fully tolerate to single bit errors\nROM - read only memory\nNonvolatile memory - memory that persists after power off\nPROM - programmable rom\nEPROM - erasable prom: erased through ultraviolet light\nEEPROM - electrically eprom\nDIP - Dual in-line package: old ICs\nSIMM - single in-line memory module: new components that stick into connectors\nDIMM - dual in-line memory module: 1990s upgrade\nSODIMM - small outline dual in-line memory module\nCache memory - memory directly accessible to the the cpu\nL1 cache - cache in cpu\nL2 cache - cache out of the cpu\nL3 cache - cache that improves performance\nNov 5, 2022\nIn computer architecture, a bus (shortened form of the Latin omnibus, and historically also called data highway or databus) is a communication system that transfers data between components inside a computer, or between computers.\nIn a computer system, a chipset is a set of electronic components in one or more integrated circuits known as a \"Data Flow Management System\" that manages the data flow between the processor, memory and peripherals.\nPCIe xn - Peripheral component interconnect express (n data lanes) - a connector that connects to input and output devices\nX is how many lanes the PCIe slot has\nThe Motherboard is the place chips connect to so they can communicate to other components of the computer. The CPU is the chip on a that connects to the motherboard that does the actual general data processing for the computer. The North bridge is a chip on a motherboard that connects the CPU to the rest of the computer (DRAM, PCIe, etc) through the FSB (front side bus), the south bridge is a different chip that connects many kinds of input and output to the north bridge.\nA protocol for computers to talk to each other\nPort 80 is for HTTP.\nRADIUS (Remote Authentication Dial-In User Service)\nWhat uses radius\nAuthenticating supplicants trying to access a lan\nIt comes back with the permissions that the client has\nSATA\nBasic Input Output System\nDomain Name System, change domain names to ip address\nInternet Service Provider\nUniversal serial bus, south bridge\nPoint-to-Point Protocol (PPP) is a data link layer (layer 2) communication protocol between two routers directly without any host or any other networking in between. It can provide connection authentication, transmission encryption,[1] and data compression.\nOpen Systems Interconnection model (OSI model)\nA network node can be defined as the connection point among network devices such as routers, printers, or switches that can receive and send data from one endpoint to the other.\nDevice connected to a network, that users use\n<a href=\"https://www.rfc-editor.org/rfc/rfc2460#section-2\">https://www.rfc-editor.org/rfc/rfc2460#section-2</a>:   node        - a device that implements IPv6. router      - a node that forwards IPv6 packets not explicitly addressed to itself.  [See Note below]   host        - any node that is not a router.  [See Note below].\nOSI\nWireless fidelity\nMedia access control\nThe logical link control (LLC) data communication protocol layer is the upper sublayer of the data link layer (layer 2) of the seven-layer OSI model. The LLC sublayer acts as an interface between the media access control (MAC) sublayer and the network layer.\nUDP - send data without having to wait for any more packets afterwards</p>\n<p>Jan 20, 2023</p>\n<ol>\n<li>DRAM - Dynamic Random Access Memory - the memory which stores the data that the processor is actively using 2. PCIe xn - Peripheral component interconnect express (n data lanes) - a connector that connects to input and output devices, usually known for connecting a graphics card, the x with the number represents how many units of data can be transferred at a time 3. Power connector - powers motherboard 4. VGA - Video Graphics Array - connection for the sending of data from monitors and other video devices to the computer 5. Parallel port - Connection for input and output devices that sends multiple bits at a time, predecessor to USB 6. USB - Universal Serial Bus - industry standard for connecting devices together, for input and output, for sending and receiving data from other computers, for even powering devices. 7. Serial port - connection where information travels one bit at a time 8. Fan connector - connection that allows communication between a computer fan and the computer it is cooling 9. SATA - Serial Advanced Technology Attachment - connects mass storage devices to the motherboard 10. PATA/IDE/ATA - Parallel Advanced Technology Attachment - connection used for storage devices, predecessor to SATA 11. North Bridge - connects the processor to the rest of the computer (DRAM, PCIe, etc) through the front-side bus 12. South Bridge - connects many kinds of input and output to the north bridge</li>\n</ol>\n<p>Open Systems Interconnection model (OSI model)</p>\n<ol>\n<li>\n<p>Physical layer - Transmission and reception of raw bit streams over a physical medium -\nThe physical technology that is used to actually send the data like hardware and cables</p>\n</li>\n<li>\n<p>Data link layer - Transmission of data frames between two nodes connected by a\nphysical layer - The data that wraps around the packets/units of data to tell when a\npacket starts and ends and similar things</p>\n</li>\n<li>\n<p>Network layer - Structuring and managing a multi-node network, including addressing,\nrouting and traffic control - The actual headers (beginnings) of packets which have the\ninformation the directs where the data goes in a network and similar information</p>\n</li>\n<li>\n<p>Transport layer - Reliable transmission of data segments between points on a network,\nincluding segmentation, acknowledgement and multiplexing - The data that manages\nnetwork traffic and the organization of units of data</p>\n</li>\n</ol>\n<p>A. TCP - Transmission Control Protocol - A protocol in the transport layer of the OSI\nmodel, which gives reliable, organized communication between computers in a\nnetwork, it is used by the world wide web, email, file transfer, among other\ninternet applications because of this</p>\n<p>B. UDP - User Datagram Protocol - A protocol that allows for the sending of data\nwithout having to communicate beforehand or make some kind of connection or\ncommunication channel, this makes it very simple but not reliable or organized</p>\n<ol start=\"5\">\n<li>\n<p>Session layer - Managing communication sessions, i.e., continuous exchange of\ninformation in the form of multiple back-and-forth transmissions between two nodes -\nThe data and mechanisms that maintains responses and requests between computers</p>\n</li>\n<li>\n<p>Presentation layer - Translation of data between a networking service and an\napplication; including character encoding, data compression and encryption/decryption -\nThe conversion of data from a form that can be transported, which may be compressed,\nencoded, or encrypted into data that can be actively used by programs</p>\n</li>\n<li>\n<p>Application layer - High-level protocols such as for resource sharing or remote file\naccess, e.g. HTTP (hypertext transfer protocol) - The procedures that actually end up\nmanaging the content that the human sees</p>\n</li>\n</ol>\n<p>IEEE 802.1x is the standard (defined by the Institute of Electrical and Electronics Engineers Standards Association) that specifies how you authenticate devices that wish to join a LAN (local area network). It determines how you use EAP (extensible authentication protocol), which is a flexible way of authenticating connections. In the standard there is an authenticator which prevents access to the network, and an authentication server, which uses RADIUS (Remote Authentication Dial-In User Service), a protocol which manages what is authorized on a network (or diameter which is RADIUS’s successor). The authentication server can respond with access rejection (it denies all access to the network), access challenge (the server asks for more credentials), and access accept (Where the device requesting access is allowed into the LAN with certain permissions).\nIEEE 802.1x is implemented in all major operating systems, and is a central part of network security. Despite this there are vulnerabilities in this standard. It was shown in 2005 that a man in the middle attack (where someone goes between a communication and frauds both sides) was possible, because after authentication, someone unauthorized could physically insert themselves. There are some alternatives to IEEE 802.1x, such as PANA (Protocol for Carrying Authentication for Network Access), but they are not used as widely.</p>\n<p>The six steps to troubleshooting:\nIdentify the problem.\nQuestion user and identify user changes to the computer.\nPerform backups before making changes.\nInquire regarding environmental or infrastructure changes.\nReview system and application logs.\nEstablish a theory of probable cause (question the obvious and if necessary\nconduct internal or external research based on symptoms).\nTest the theory to determine cause:\nOnce theory is confirmed, determine next steps to resolve the problem.\nIf theory is not confirmed, re-establish new theory or escalate.\nEstablish a plan of action to resolve the problem and implement the solution.\nVerify full system functionality, and if applicable, implement preventative\nmeasures.\nDocument findings, actions, and outcomes.</p>\n<p>The use of 802.1x on Linux depends on what distribution of Linux you are using. But, in general there are 2 main projects for 802.1x supplicants, Xsupplicant and wpa_supplicant, which are developed by Open1x and Jouni Malinen respectively. They both work on windows too and wpa_supplicant also supports BSD and OS X. On the Linux distribution Ubuntu, wpa_suplicant is already loaded.[1]\nOn Linux 802.1x is mainly configured using networkManager, which is a program for configuring network interfaces. Mac OS has supported 802.1x out of the box since version 10.3. The settings for 802.1x on Mac OS are in settings then network. While iOS has had support since version 2.0.</p>\n<p>The IP address is the 32 bit (binary digit) number that is related to networking, and it is\nsimply what identifies hosts on an internet network. A host on a network is any computer or\ndevice that connects to a network, while a network is a group of computers that are connected\ntogether to communicate data. An octet is a group of eight bits. Because an IP address is 32\nbits long, it is also four octets long. Because humans struggle to read binary, the IP address is\nconverted to four decimal numbers separated by dots for humans to read.\nThe parts of the IP address which designate the host address and the network address\naren't fixed, so the information for which part of the IP address is what, is in the subnet mask.\nThis number may be something like 255.255.255.0. The number 255 is special in that it is the\neight bit unsigned integer limit, which means that it is represented in binary as 11111111. This\nmeans that in binary 255.255.255.0 is 11111111111111111111111100000000. How the information\nis read is that the ones represent parts of the IP address that are for the network address, and\nThe zeros are the parts that are the host address. So for the subnet mask 255.255.255.0, the\nThe first three octets are for the network address and the last one is for the host address. IP\naddresses are split into classes. A class A subnet mask looks like 255.0.0.0, and the first octet\nof a class A address is in a range from 1 to 127. A class B subnet mask looks like 255.255.0.0,\nand the first octet is in a range from 128 to 191. A class C subnet mask looks like\n255.255.255.0 and the first octet is in a range from 192 to 223.</p>\n<p>A system administrator is someone with access to a system of computers and operates and manages a network. . A subnet mask is a 32 bit number that separates the network and host addresses. The 1 bits on a subnet mask mean that the section of bits is in the network address. The 0 bits on a subnet mask means that the section of bits is in the host address. The subnet mask 255.255.255.0 in binary looks like 11111111111111111111111100000000. When you change a subnet mask from 255.255.255.255.0 to .192 it causes 4 new networks to be available, because 11111111111111111111111111000000 has 2 more bits as part of the network address, so 4x as many possible network addresses. A default gateway is what lets a device on one subnet access devices on other networks. If you have an incorrect subnet mask, then devices on the subnet can communicate with hosts outside the subnet, but not with each other. If you have an incorrect IP address, hosts on the same network won’t be able to communicate because they will think they are on different networks. If you have an incorrect default gateway, then a host will be able to communicate with hosts on its subnet, but not with hosts outside of it. The 2 references are \"TCP/IP Illustrated, Volume 1: The Protocols,\" Richard Stevens, Addison Wesley, 1994, and \"Internetworking with TCP/IP, Volume 1: Principles, Protocols, and Architecture,\" Douglas E. Comer, Prentice Hall, 1995.</p>\n<p>Domain\nDifferent users different access rights\nWork groups should be at most 20, domains make sense to move to after\nStorage database/active directory in server\nCentralized server for\nGoogle does it for school\nDon't have to be on the same local network\nHave hierarchy, root, top level, second level, sub domain</p>\n<p>Workgroups are computers that are peers for small networks on a local network.\nNo central admin, each device has its own storage and is managed by the user,\nA user must have an account on the device to log in\nWorkgroups let sharing of files and resources, </p>\n<p>`\nIDE is an interface (basically ATA)</p>\n<p>Mar 1, 2023\nNslookup\nname server lookup\nCommand-line tool for network administration; it queries DNS servers for the IP addresses and other information corresponding to domain names.\nThis command is similar to the dig and host unix commands, and is available on many operating systems, such as unix-like OSes and windows.\nExample:\nnslookup -type=ns google.com ##find name servers for domain\nnslookup google.com ns1.google.com ##use a name server for a dns request\nnslookup 1.1.1.1 ##reverse dns lookup for cloudflare\nNetstat\nnetwork statistics\nA command-line utility for displaying TCP connections, routing tables, network interfaces, and protocol statistics. Used for finding network problems and usage statistics/performance.\nIt is available on many systems, unix/unix-like and windows.\nExample:\nnetstat -ab ##displays all tcp connections and tcp/udp ports listened on, while also displaying the executable involved in making the connection\nnetstat -an ##displays all tcp connections and tcp/udp ports listened on, but no attempt is made to determine names (shown numerically), so it's a faster command to run\nnetstat -ao 5 ##displays the process ID for all connections, every 5 seconds\nNet user\nmaintains network users\nAdds or modifies user accounts, or displays user account information; takes as parameters, username, password, domain, and options.\nThis command has many options, such as disabling users, or listing accounts if not provided with parameters. It is available on windows.\nExample:\nnet user friend /add /passwordreq:no /homedir:c:\\ ##add a user with no pass requirements, whos home directory is c\nnet user carlo student /add ##add a user with pass student\nnet user carlo NewPass /logonpasswordchg:yes ## change a users password and force them to change while logging in</p>\n<p>Mar 3, 2023\nLISTEN - represents waiting for a connection request from any remote\nTCP and port.\nThe device is waiting for a computer to request a connection from a port.\nSYN-SENT - represents waiting for a matching connection request\nafter having sent a connection request.\nThe device has sent a SYN (synchronize) message to the server and is waiting for a SYN-ACK (acknowledge) message.\nSYN-RECEIVED - represents waiting for a confirming connection\nrequest acknowledgment after having both received and sent a\nconnection request.\nThe device has received a SYN-ACK, and has sent an ACK.\nESTABLISHED - represents an open connection, data received can be\nIn computer architecture, a bus (shortened form of the Latin omnibus, and historically also called data highway or databus) is a communication system that transfers data between components inside a computer, or between computers.\nIn a computer system, a chipset is a set of electronic components in one or more integrated circuits known as a \"Data Flow Management System\" that manages the data flow between the processor, memory and peripherals.\nPCIe xn - Peripheral component interconnect express (n data lanes) - a connector that connects to input and output devices\nX is how many lanes the PCIe slot has\nThe Motherboard is the place chips connect to so they can communicate to other components of the computer. The CPU is the chip on a that connects to the motherboard that does the actual general data processing for the computer. The North bridge is a chip on a motherboard that connects the CPU to the rest of the computer (DRAM, PCIe, etc) through the FSB (front side bus), the south bridge is a different chip that connects many kinds of input and output to the north bridge.\nA protocol for computers to talk to each other\nPort 80 is for HTTP.\nRADIUS (Remote Authentication Dial-In User Service)\nWhat uses radius\nAuthenticating supplicants trying to access a lan\nIt comes back with the permissions that the client has\nSATA\nBasic Input Output System\nDomain Name System, change domain names to ip address\nInternet Service Provider\nUniversal serial bus, south bridge\nPoint-to-Point Protocol (PPP) is a data link layer (layer 2) communication protocol between two routers directly without any host or any other networking in between. It can provide connection authentication, transmission encryption,[1] and data compression.\nOpen Systems Interconnection model (OSI model)\nA network node can be defined as the connection point among network devices such as routers, printers, or switches that can receive and send data from one endpoint to the other.\nDevice connected to a network, that users use\n<a href=\"https://www.rfc-editor.org/rfc/rfc2460#section-2\">https://www.rfc-editor.org/rfc/rfc2460#section-2</a>:   node        - a device that implements IPv6. router      - a node that forwards IPv6 packets not explicitly addressed to itself.  [See Note below]   host        - any node that is not a router.  [See Note below].\nOSI\nWireless fidelity\nMedia access control\nThe logical link control (LLC) data communication protocol layer is the upper sublayer of the data link layer (layer 2) of the seven-layer OSI model. The LLC sublayer acts as an interface between the media access control (MAC) sublayer and the network layer.\nUDP - send data without having to wait for any more packets afterwards\ndelivered to the user.  The normal state for the data transfer phase\nof the connection.\nThe computers know they can communicate with each other.\nFIN-WAIT-1 - represents waiting for a connection termination request\nfrom the remote TCP, or an acknowledgment of the connection\ntermination request previously sent.\nServer receives\nFIN-WAIT-2 - represents waiting for a connection termination request\nfrom the remote TCP.</p>\n<p>CLOSE-WAIT - represents waiting for a connection termination request\nfrom the local user.\nWaiting for all the packets to make it, waiting for the request to end the connection from the user.\nCLOSING - represents waiting for a connection termination request\nacknowledgement from the remote TCP.</p>\n<p>LAST-ACK - represents waiting for an acknowledgment of the\nconnection termination request previously sent to the remote TCP\n(which includes an acknowledgment of its connection termination\nrequest).</p>\n<p>Waiting for the final acknowledgment from the server.\nTIME-WAIT - represents waiting for enough time to pass to be sure\nthe remote TCP received the acknowledgment of its connection\ntermination request.</p>\n<p>CLOSED - represents no connection state at all.\nThe computer is not connected, or going to, it has finished a connection.\nApr 12, 2023</p>\n<p>Quad Cyber Challenge the white house\nLandy was immigrants went from working with steven spiel beer g to boeing a restriction cyber security all of them did to go protect the nation\nWork for the government got to west point declare war on the terrorism then into I</p>\n<p>Apr 18, 2023\nChrome OS is web based and on linux\nOperating system\nKernel\nMultiprocessing-\nMulti threading-\nMulti tasking-ability to run multiple applications simultaneously\nEnterprise\nBASH\nSTaaS storage as a service\nIaaS\nMission control:\n<a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">Dashboard multiple desktop all windows (Private)</a>secure notes spotlight boot camp system preferences\nFind document they no have: spotlight\nFlash drives to storage media cheap\nSata 3 used for hard drives\n4 ports 4 devices\nBlu ray disk that can hold up to 100 gb of data: triple layer\nRedundant array of independent disks\nParity and striping\nRAID 5 striping + parity, minimum 3 drives\nRAID 10 -\nFat32</p>\n<p>Install a new storage device on the system\nAdd free space on a new storage device to a storage pool\nAllocate space from storage to existing storage space\nFailure of hard drive arm</p>\n<p>Keeps the data private : private cloud storage</p>\n<p>Hypervisor - thin layer of software the virtual machine and the hardware\nHost machine\nVirtual machine\nVirtual hard disk</p>\n<p>Syn\nAck\nSyn-ack</p>","noteIndex":{"id":"dlykua5hcrb6xvaq2hyi0yd","title":"Root","desc":"","updated":1686947477703,"created":1686935718592,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":".","selfContained":true,"name":"cyber"},"contentHash":"8001bc9e36db8a982039219700055316","links":[],"anchors":{"cyber-security-notes":{"type":"header","text":"Cyber Security notes","value":"cyber-security-notes","line":7,"column":0,"depth":1},"useful-links":{"type":"header","text":"useful links","value":"useful-links","line":9,"column":0,"depth":2}},"children":["61vh3qb7owg5f472h5dyeay","yez11bcguulxusiwtos1r2x","l1goly4kiyvtmqhtm2gk6ll"],"parent":null,"data":{},"body":"# Cyber Security notes\n\n## useful links\nhttps://comptiacdn.azureedge.net/webcontent/docs/default-source/exam-objectives/comptia-a-220-1101-exam-objectives-(5-0).pdf\nhttps://comptiacdn.azureedge.net/webcontent/docs/default-source/exam-objectives/comptia-a-220-1102-exam-objectives-(5-0).pdf?sfvrsn=c7d9bb9a_2\n\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true,"enableSelfContainedVaults":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":".","selfContained":true,"name":"cyber"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"task","dateFormat":"y.MM.dd","addBehavior":"asOwnDomain","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"taskCompleteStatus":["done","x"],"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link"},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"enableFullHierarchyNoteTitle":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"Dendron","description":"Personal Knowledge Space"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"search","siteUrl":"https://givingdonation.github.io","assetsPrefix":"/last-minute-cert","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}